In [1]:
import pandas as pd
import matplotlib.pyplot as plt
import numpy as np
import seaborn as sns
import math

In [2]:
fname='D:/ML_basics_Python/datasets/housing/Salary Data (1).csv'

In [3]:
df=pd.read_csv(fname)
df.head()

,Age,Gender,Education Level,Job Title,Years of Experience,Salary
0,32.0,Male,Bachelor's,Software Engineer,5.0,90000.0
1,28.0,Female,Master's,Data Analyst,3.0,65000.0
2,45.0,Male,PhD,Senior Manager,15.0,150000.0
3,36.0,Female,Bachelor's,Sales Associate,7.0,60000.0
4,52.0,Male,Master's,Director,20.0,200000.0

In [5]:
df.isnull().sum()

Age                    2
Gender                 2
Education Level        2
Job Title              2
Years of Experience    2
Salary                 2
dtype: int64

In [6]:
df['Age'] = df['Age'].fillna(df['Age'].mean())
df['Years of Experience'] = df['Years of Experience'].fillna(df['Years of Experience'].mean())
df['Salary'] = df['Salary'].fillna(df['Salary'].mean())

In [7]:
most_frequent_category= df['Gender'].mode().iloc[0]
df['Gender'].fillna(most_frequent_category, inplace=True)

most_frequent_category= df['Job Title'].mode().iloc[0]
df['Job Title'].fillna(most_frequent_category, inplace=True)

most_frequent_category= df['Education Level'].mode().iloc[0]
df['Education Level'].fillna(most_frequent_category, inplace=True)

In [9]:
df.isnull().sum()

Age                    0
Gender                 0
Education Level        0
Job Title              0
Years of Experience    0
Salary                 0
dtype: int64

In [11]:
from sklearn.preprocessing import LabelEncoder
le=LabelEncoder()
DF=df
DF.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 375 entries, 0 to 374
Data columns (total 6 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   Age                  375 non-null    float64
 1   Gender               375 non-null    object
 2   Education Level      375 non-null    object
 3   Job Title            375 non-null    object
 4   Years of Experience  375 non-null    float64
 5   Salary               375 non-null    float64
dtypes: float64(3), object(3)
memory usage: 17.7+ KB

In [12]:
#its importanct to convert object datatypes to numerical values for device understanding
DF['Gender']=le.fit_transform(DF['Gender'])
DF['Education Level']=le.fit_transform(DF['Education Level'])
DF['Job Title']=le.fit_transform(DF['Job Title'])

In [13]:
DF.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 375 entries, 0 to 374
Data columns (total 6 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   Age                  375 non-null    float64
 1   Gender               375 non-null    int32
 2   Education Level      375 non-null    int32
 3   Job Title            375 non-null    int32
 4   Years of Experience  375 non-null    float64
 5   Salary               375 non-null    float64
dtypes: float64(3), int32(3)
memory usage: 13.3 KB

In [14]:
X=DF.drop(columns=['Salary'])
Y=DF['Salary']

In [15]:
X

      Age  Gender  Education Level  Job Title  Years of Experience
0    32.0       1                0        159                  5.0
1    28.0       0                1         17                  3.0
2    45.0       1                2        130                 15.0
3    36.0       0                0        101                  7.0
4    52.0       1                1         22                 20.0
..    ...     ...              ...        ...                  ...
370  35.0       0                0        131                  8.0
371  43.0       1                1         30                 19.0
372  29.0       0                0         70                  2.0
373  34.0       1                0        137                  7.0
374  44.0       0                2        110                 15.0

[375 rows x 5 columns]

In [16]:
Y

0       90000.0
1       65000.0
2      150000.0
3       60000.0
4      200000.0
         ...
370     85000.0
371    170000.0
372     40000.0
373     90000.0
374    150000.0
Name: Salary, Length: 375, dtype: float64

<h1> K fold cross Validation

In [17]:
from sklearn.tree import DecisionTreeRegressor

In [20]:
DTregressor= DecisionTreeRegressor(criterion='squared_error',
                                   max_depth=10,
                                   min_samples_split=2,
                                   min_samples_leaf=1,
                                   max_features=None,
                                   max_leaf_nodes=None,
                                   min_impurity_decrease=0.0
                                   )

In [21]:
from sklearn.model_selection import cross_val_score
from sklearn.model_selection import KFold

k_fold= KFold(10)

results1=cross_val_score(DTregressor,X,Y, cv=k_fold, scoring='neg_mean_squared_error')
results2=cross_val_score(DTregressor,X,Y, cv=k_fold, scoring='neg_mean_absolute_percentage_error')
results3=cross_val_score(DTregressor,X,Y, cv=k_fold, scoring='r2')

In [24]:
#print(results1) #negative MSE
#print(results2) #negative MAPE
overall_MAE_percentage= sum(results2)/len(results2)
print(abs(overall_MAE_percentage))
#print(results3)

0.383458296174268